label start:
	$ ashley_relations = 0
	Вселенная настолько огромна, что просто не может укладываться в голове обычного человека.
	Если мысленно уменьшить Солнце до размеров футбольного мяча, то Земля превратится в точку на расстоянии нескольких метров от этого шара, ползущую со скоростью нескольких миллиметров в час.
	Проксима Центавра - ближайшая к нам звезда - окажется мячиком в нескольких километрах от Солнца.
	Это, человек с развитым пространственным мышлением представить ещё способен.
	Но размеры Галактики будут по прежнему невообразимо огромны.
	Продолжим увеличивать масштаб - даже уменьшив Солнце до размеров атома, Млечный путь все равно будет простираться на многие километры. Примитивный мозг вида homo не в состоянии по настоящему представить такие размеры...
	А предположить, что существо, неспособное своим жалким разумом даже представить размеры Галактики, сможет путешествовать по ней, обгоняя свет и искривляя пространство-время - "нет, позвольте, это же бред" - заявит вам любой разумный, никогда не контактировавший с землянами.
	Но тем не менее - из всех правил бывают  исключения - и земляне действительно овладели технологиями перемещения быстрее скорости света, на сотни тысяч лет раньше, чем это позволила бы им эволюция.
	...
	`-- [Рейдер ГСП | Алекс] --`
	...
	Ему жутко хотелось есть.
	Последние восемь часов Алекс провёл в кресле пилота, наблюдая за работой компьютера.
	Это было совершенно ненужно, но он почему-то не доверяя автоматике и предпочитал контроллировать всё, что делает автопилот, чтобы, в случае чего, успеть вмешаться.
	Автопилоту было всё равно. Он просто сделал свою работу, как всегда идеально.
	Алекс выдернул флешку с астрогационными данными из гнезда бортового компьютера, сразу же после появления на дисплее надписи на англике “Route completed”.
	Корабль совершил сложный пунктир (серию гиперпространственных прыжков) через несколько поясов, преодолев почти треть диаметра Млечного пути - и закончил его где-то в пустоте.
	Он находился в паре мегаметров от небольшой и ничем не примечательной красной звезды -- карлика, уже прожившего свою долгую звёздную жизнь и теперь медленно дожигающего свои последние крохи водорода.
	У безымянной звезды не было даже планет -- скорее всего они были утрачены миллиарды лет назад, когда та превратилась в сверхновую. Лишь горстка астероидов на вытянутых орбитах напоминали о былом.
	Кроме этой звезды, поблизости не было ни одного хоть сколько-нибудь массивного (в масштабах звёзд) объекта, однако что-то все-таки излучало радиоволны, в узком диапазоне, на почти постоянной частоте.
	Источник радиоволн очень походил на искуственный, однако в галактическом навигаторе не содержалось информации ни об одном объекте возле этой звезды.
	Ни поселений, ни автоматических станций, ни даже вшивого радиобакена сигнализирующего о претензиях какого-то правительства на эту звезду.
	Согласно базе, здесь не должно было быть ничего. Согласно базе, здесь в радиусе нескольких десятков парсек ни разу не пролетал ни один корабль. Однако сигнал что-то всё-таки излучало...
	Поэтому звездой и заинтересовались. Если можно считать "интересом" то, что она попала в каталог "потенциально интересных" объектов под низким приоритетом и спустя долгое-долгое время Алекс, пилот группы свободного поиска, случайно наткнулся на запись и решил обследовать эту звезду.
	Ему жутко хотелось есть.
	Стоило бы запустить сканирование системы и отправиться в соседний отсек корабля за едой. Чёрт возьми, стоило отправиться за едой несколько часов назад, просто оставив автопилот наедине с самим собой.
	Но Алекс предпочитал голодать, но не оставлять запущенные программы без внимания ни на минуту.
	Подозрительно оглядев экраны он заблокировал консоль (хотя для этого тоже не было никаких оснований) и только после этого отстегнулся от кресла и поплыл в царящей в корабле невесомости в люк над головой.
	Нелюбовь к искуственной гравитации тоже была одной из его странностей.
	На большинстве человеческих кораблей автоматика поддерживает искуственное ускорение в 8-10 м/с² в зависимости от привычек (силы тяжести в родном мире) экипажа или пассажиров.
	Для этого используется корабельный икс-привод, который в основном служит двигателем корабля, искривляя гравитационное поле вокруг корабля так, чтобы тот перемещался в пространстве.
	По сравнению с искривлениями пространства, разгоняющими корабли до релятивистских скоростей, объём гравитационного поля внутри корабля очень мал и поддержание искуственной гравитации тратит сущие капли энергии.
	Но Алексу просто нравилась невесомость.
	Он парил в бытовом отсеке корабля, неспеша глотая невнятную субстанцию, выданную ему кухонным синтезатором пищи.
	Ровно необходимое ему число белков, углеводов, жиров, витаминов и микроэлементов, ни микрограммом больше или меньше. Число было точно подсчитанно нанороботами, миллиардами засеянными в кровеносную систему Алекса и передано через корабельную сеть в искуственный интеллект кухонного компьютера.
	Полученная субстанция была бесвкусной, бесцветной и почти жидкой.
	Алекс сделал последний глоток и почувствовал, что часть корабельных систем, отключённая во время сверхсветовых прыжков, проснулась.
	...
	`-- [Рейдер ГСП | Эшли] --`
	...
	_-- Привет, Алекс._
	Голос, моделируемый компьютерным синтезатором речи, звучит на удивление естественно и мягко.
	Алекс вздрогнул, вновь услышав его.
	По инструкции ГСП, всем пилотам-одиночкам, в рейсе предписанно использовать искуственный интеллект, симулирующий напарника. В корабле, который выдали Алексу, таким компьютерным напарником оказалась Эшли.
	Интеллектуальная компьютерная система, превосходящая возможности человека на много порядков, при этом говорящая голосом девочки пубертатного возраста.
	menu:
		Поздороваться
			jump hello
		Игнорировать
			jump ignor

label ignor:
	$ ashley_relations -= 1
	Алекс ненавидел искуственный интеллект вообще, и искуственный интеллект, изображающий маленьких девочек в особенности.
	По инструкции полностью отключать компьютерного помошника было запрещено. Но, к счастью инструкция прямо не запрещала игнорировать её существование.
	Алекс выбросил пакет от пищи в корабельный утилизатор и проплыл обратно в рубку.
	jump ending

label hello:
	$ ashley_relations += 1
	-- Привет, Эшли -- произнёс Алекс как можно более холодно.
	Он недолюбливал искуственный интеллект вообще, и искуственный интеллект, симулирующий поведение человека в особенности.
	Поэтому старался в общении с навязанным ему компьютерным помошником обходиться минимумом дежурных фраз
	jump ending

label ending:
	_-- Послушай..._
	if ashley_relations > 0:
		_... я люблю тебя!_
	else:
		jump badend
	return

label badend:
	_... а впрочем ничего_
	Момент, в котором Эшли вас убивает
	return